[Killed] StringLiteral
Aula_15.2/exercise-digimon-finders/src/App.js:8:35
 class App extends React.Component {
   constructor() {
     super();
-    this.state = { searchDigimon: '', isFetching: false, errorMessage: '' };
+    this.state = { searchDigimon: "Stryker was here!", isFetching: false, errorMessage: '' };
   }
 

[Timeout] BlockStatement
Aula_15.2/exercise-digimon-finders/src/App.js:18:32
     }));
   }
 
-  requestDigimon = async () => {
-    const { searchDigimon } = this.state;
-    if (searchDigimon.trim()) {
-      fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
-        .then((res) => res.json())
-        .then((results) => this.setState((state) => ({
-          ...state,
-          digimon: results[0],
-          errorMessage: results["ErrorMsg"],
-          isFetching: true,
-        })));
-    }
-  }
+  requestDigimon = async () => {}
 
   render() {

[Timeout] ConditionalExpression
Aula_15.2/exercise-digimon-finders/src/App.js:20:9
 
   requestDigimon = async () => {
     const { searchDigimon } = this.state;
-    if (searchDigimon.trim()) {
+    if (false) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
         .then((res) => res.json())

[Survived] ConditionalExpression
Aula_15.2/exercise-digimon-finders/src/App.js:20:9
 
   requestDigimon = async () => {
     const { searchDigimon } = this.state;
-    if (searchDigimon.trim()) {
+    if (true) {
       fetch(`https://digimon-api.vercel.app/api/digimon/name/${searchDigimon}`)
         .then((res) => res.json())
